document.addEventListener('DOMContentLoaded', function() {
    const startTestBtn = document.getElementById('start-test-btn');
    const quizForm = document.getElementById('quiz-form');
    const quizControls = document.getElementById('quiz-controls');
    const prevBtn = document.getElementById('prev-btn');
    const nextBtn = document.getElementById('next-btn');
    const finishBtn = document.getElementById('finish-btn');
    const resultSection = document.getElementById('result');
    const scoreDisplay = document.getElementById('score');
    const welcomeText = document.querySelector('h1');

    const questions = [
        {
            question: '1. Аллаһ есімі нені білдіреді?',
            answers: {
                a: 'Жаратушы, Иесі',
                b: 'Аса рақымды, Аса мейірімді',
                c: 'Мейірбан, Ерекше мейірімді',
                d: 'Патша, билік Иесі'
            },
            correctAnswer: 'a'
        },
        {
            question: '2. Ар-Рахмаан есімі нені білдіреді?',
            answers: {
                a: 'Толық басқарушы',
                b: 'Киелі',
                c: 'Аса рақымды, Аса мейірімді',
                d: 'Жаратушы'
            },
            correctAnswer: 'c'
        },
        {
            question: '3. Ар-Рахиим есімі нені білдіреді?',
            answers: {
                a: 'Бәрінен Хабардар',
                b: 'Мейірбан, Ерекше мейірімді',
                c: 'Мақтаулы',
                d: 'Дәрежені төмендетуші'
            },
            correctAnswer: 'b'
        },
        {
            question: '4. Әл-Мәлик есімі нені білдіреді?',
            answers: {
                a: 'Патша, билік Иесі',
                b: 'Аса қасиетті, Киелі',
                c: 'Бейбітшіл',
                d: 'Аса рақымды, Аса мейірімді'
            },
            correctAnswer: 'a'
        },
        {
            question: '5. Әл-Қуддуус есімі нені білдіреді?',
            answers: {
                a: 'Аса рақымды, Аса мейірімді',
                b: 'Толық басқарушы',
                c: 'Бейбітшіл',
                d: 'Аса қасиетті, Киелі'
            },
            correctAnswer: 'd'
        },
        {
            question: '6. Әс-Сәләәм есімі нені білдіреді?',
            answers: {
                a: 'Аса рақымды, Аса мейірімді',
                b: 'Бейбітшіл',
                c: 'Толық басқарушы',
                d: 'Аса қасиетті, Киелі'
            },
            correctAnswer: 'b'
        },
        {
            question: '7. Әл-Мумин есімі нені білдіреді?',
            answers: {
                a: 'Аса сенімді',
                b: 'Аса қасиетті, Киелі',
                c: 'Толық басқарушы',
                d: 'Бейбітшіл'
            },
            correctAnswer: 'a'
        },
        {
            question: '8. Әл-Муһәймин есімі нені білдіреді?',
            answers: {
                a: 'Аса қасиетті, Киелі',
                b: 'Аса рақымды, Аса мейірімді',
                c: 'Толық басқарушы',
                d: 'Аса мейірімді, Аса рақымды'
            },
            correctAnswer: 'c'
        },
        {
            question: '9. Әл-Азииз есімі нені білдіреді?',
            answers: {
                a: 'Аса рақымды, Аса мейірімді',
                b: 'Аса сенімді',
                c: 'Бейбітшіл',
                d: 'Үстем, Аса даңқты, құдіретті'
            },
            correctAnswer: 'd'
        },
        {
            question: '10. Әл-Жаббаар есімі нені білдіреді?',
            answers: {
                a: 'Аса сенімді',
                b: 'Толық басқарушы',
                c: 'Аса рақымды, Аса мейірімді',
                d: 'Бойсұндырушы, Аса құдіретті'
            },
            correctAnswer: 'd'
        },
        {
            question: '11. Әл-Мутәкәббир есімі нені білдіреді?',
            answers: {
                a: 'Тәкаппар, Аса жоғары',
                b: 'Үстем, Аса даңқты, құдіретті',
                c: 'Бейбітшіл',
                d: 'Аса рақымды, Аса мейірімді'
            },
            correctAnswer: 'a'
        },
        {
            question: '12. Әл-Хаалиқ есімі нені білдіреді?',
            answers: {
                a: 'Мейірбан, Ерекше мейірімді',
                b: 'Аса жоғары',
                c: 'Жаратушы',
                d: 'Патша, билік Иесі'
            },
            correctAnswer: 'c'
        },
        {
            question: '13. Әл-Баари есімі нені білдіреді?',
            answers: {
                a: 'Жоқтан бар етуші',
                b: 'Аса рақымды, Аса мейірімді',
                c: 'Толық басқарушы',
                d: 'Жаратушы'
            },
            correctAnswer: 'a'
        },
        {
            question: '14. Әл-Мусаууир есімі нені білдіреді?',
            answers: {
                a: 'Аса рақымды, Аса мейірімді',
                b: 'Бейнелеуші',
                c: 'Мейірбан, Ерекше мейірімді',
                d: 'Аса сенімді'
            },
            correctAnswer: 'b'
        },
        {
            question: '15. Әл-Ғаффар есімі нені білдіреді?',
            answers: {
                a: 'Жаратушы',
                b: 'Төмендетуші, Түсіруші',
                c: 'Аса қасиетті, Киелі',
                d: 'Кешірімшіл, Аса кешірімді'
            },
            correctAnswer: 'd'
        },
        {
            question: '16. Әл-Қаһһар есімі нені білдіреді?',
            answers: {
                a: 'Толық басқарушы',
                b: 'Аса сенімді',
                c: 'Өктем, шексіз қаһар Иесі',
                d: 'Аса құдіретті, Бойсұндырушы'
            },
            correctAnswer: 'c'
        },
        {
            question: '17. Әл-Уаһһаб есімі нені білдіреді?',
            answers: {
                a: 'Бейбітшіл',
                b: 'Сый беруші',
                c: 'Мейірбан, Ерекше мейірімді',
                d: 'Патша, билік Иесі'
            },
            correctAnswer: 'b'
        },
        {
            question: '18. Ар-Раззақ есімі нені білдіреді?',
            answers: {
                a: 'Аса рақымды, Аса мейірімді',
                b: 'Ризықтандырушы',
                c: 'Аса қасиетті, Киелі',
                d: 'Мейірбан, Ерекше мейірімді'
            },
            correctAnswer: 'b'
        },
        {
            question: '19. Әл-Фаттах есімі нені білдіреді?',
            answers: {
                a: 'Жеңуші, Ашушы',
                b: 'Бәрінен Хабардар',
                c: 'Аса рақымды, Аса мейірімді',
                d: 'Аса сенімді'
            },
            correctAnswer: 'a'
        },
        {
            question: '20. Әл-Алиим есімі нені білдіреді?',
            answers: {
                a: 'Жаратушы',
                b: 'Аса қасиетті, Киелі',
                c: 'Аса рақымды, Аса мейірімді',
                d: 'Бәрін Білуші'
            },
            correctAnswer: 'd'
        },
        {
            question: '21. Әл-Қаабид есімі нені білдіреді?',
            answers: {
                a: 'Мейірбан, Ерекше мейірімді',
                b: 'Толық басқарушы',
                c: 'Тарылтушы',
                d: 'Бейбітшіл'
            },
            correctAnswer: 'c'
        },
        {
            question: '22. Әл-Баасит есімі нені білдіреді?',
            answers: {
                a: 'Аса қасиетті, Киелі',
                b: 'Аса рақымды, Аса мейірімді',
                c: 'Кеңейтуші',
                d: 'Бейбітшіл'
            },
            correctAnswer: 'c'
        },
        {
            question: '23. Әл-Хаафид есімі нені білдіреді?',
            answers: {
                a: 'Төмендетуші, Түсіруші',
                b: 'Аса рақымды, Аса мейірімді',
                c: 'Мейірбан, Ерекше мейірімді',
                d: 'Патша, билік Иесі'
            },
            correctAnswer: 'a'
        },
        {
            question: '24. Ар-Раафиъ есімі нені білдіреді?',
            answers: {
                a: 'Мейірбан, Ерекше мейірімді',
                b: 'Толық басқарушы',
                c: 'Аса рақымды, Аса мейірімді',
                d: 'Жоғарылатушы, Биіктетуші'
            },
            correctAnswer: 'd'
        },
        {
            question: '25. Әл-Муъиззу есімі нені білдіреді?',
            answers: {
                a: 'Толық басқарушы',
                b: 'Даңқты асырушы, жеңіс беруші',
                c: 'Мейірбан, Ерекше мейірімді',
                d: 'Патша, билік Иесі'
            },
            correctAnswer: 'b'
        },
        {
            question: '26. Әл-Музиллу есімі нені білдіреді?',
            answers: {
                a: 'Толық басқарушы',
                b: 'Аса рақымды, Аса мейірімді',
                c: 'Дәрежені төмендетуші',
                d: 'Бейбітшіл'
            },
            correctAnswer: 'c'
        },
        {
            question: '27. Әс-Сәмииъу есімі нені білдіреді?',
            answers: {
                a: 'Бәрін Естуші',
                b: 'Аса қасиетті, Киелі',
                c: 'Мейірбан, Ерекше мейірімді',
                d: 'Жаратушы'
            },
            correctAnswer: 'a'
        },
        {
            question: '28. Әл-Басиир есімі нені білдіреді?',
            answers: {
                a: 'Толық басқарушы',
                b: 'Аса рақымды, Аса мейірімді',
                c: 'Аса қасиетті, Киелі',
                d: 'Бәрін Көруші'
            },
            correctAnswer: 'd'
        },
        {
            question: '29. Әл-Хакам есімі нені білдіреді?',
            answers: {
                a: 'Аса рақымды, Аса мейірімді',
                b: 'Қазы, Төреші',
                c: 'Мейірбан, Ерекше мейірімді',
                d: 'Патша, билік Иесі'
            },
            correctAnswer: 'b'
        },
        {
            question: '30. Әл-Адл есімі нені білдіреді?',
            answers: {
                a: 'Әділетті',
                b: 'Аса рақымды, Аса мейірімді',
                c: 'Толық басқарушы',
                d: 'Бейбітшіл'
            },
            correctAnswer: 'a'
        },
        {
            question: '31. Әл-Латииф есімі нені білдіреді?',
            answers: {
                a: 'Аса рақымды, Аса мейірімді',
                b: 'Аса қасиетті, Киелі',
                c: 'Жұмсақ, Мейірімді',
                d: 'Бейбітшіл'
            },
            correctAnswer: 'c'
        },
        {
            question: '32. Әл-Хабиир есімі нені білдіреді?',
            answers: {
                a: 'Аса қасиетті, Киелі',
                b: 'Мейірбан, Ерекше мейірімді',
                c: 'Толық басқарушы',
                d: 'Бәрінен хабардар'
            },
            correctAnswer: 'a'
        },
        {
            question: '33. Әл-Халиим есімі нені білдіреді?',
            answers: {
                a: 'Ұстамды, мейірімді',
                b: 'Төмендетуші, Түсіруші',
                c: 'Толық басқарушы',
                d: 'Мейірбан, Ерекше мейірімді'
            },
            correctAnswer: 'a'
        },
        {
            question: '34. Әл-Азиим есімі нені білдіреді?',
            answers: {
                a: 'Алғыс Иесі, жақсылыққа қарымта қайтарушы',
                b: 'Ұлық, Ардақты',
                c: 'Толық басқарушы',
                d: 'Мейірбан, Ерекше мейірімді'
            },
            correctAnswer: 'b'
        },
        {
            question: '35. Әл-Ғафуур есімі нені білдіреді?',
            answers: {
                a: 'Кешіруші, Кешірімді',
                b: 'Алғыс Иесі, жақсылыққа қарымта қайтарушы',
                c: 'Жоғарылатушы, Биіктетуші',
                d: 'Бәрінен хабардар'
            },
            correctAnswer: 'a'
        },
        {
            question: '36. Әш-Шәкуур есімі нені білдіреді?',
            answers: {
                a: 'Кешіруші, Кешірімді',
                b: 'Алғыс Иесі, жақсылыққа қарымта қайтарушы',
                c: 'Жоғарылатушы, Биіктетуші',
                d: 'Бәрінен хабардар'
            },
            correctAnswer: 'b'
        },
        {
            question: '37. Әл-Алий есімі нені білдіреді?',
            answers: {
                a: 'Кешіруші, Кешірімді',
                b: 'Алғыс Иесі, жақсылыққа қарымта қайтарушы',
                c: 'Асқақ, Бәрінен Биік',
                d: 'Бәрінен хабардар'
            },
            correctAnswer: 'c'
        },
        {
            question: '38. Әл-Кәбиир есімі нені білдіреді?',
            answers: {
                a: 'Толық басқарушы',
                b: 'Асқақ, Бәрінен Биік',
                c: 'Үлкен, Аса зор',
                d: 'Мейірбан, Ерекше мейірімді'
            },
            correctAnswer: 'c'
        },
        {
            question: '39. Әл-Хафииз есімі нені білдіреді?',
            answers: {
                a: 'Сақтаушы, қорғаушы',
                b: 'Асқақ, Бәрінен Биік',
                c: 'Аса ұлық, аса мәртебелі',
                d: 'Мейірбан, Ерекше мейірімді'
            },
            correctAnswer: 'a'
        },
        {
            question: '40. Әл-Муқиит есімі нені білдіреді?',
            answers: {
                a: 'Сақтаушы, қорғаушы',
                b: 'Қорек беруші',
                c: 'Есептеуші',
                d: 'Алғыс Иесі, жақсылыққа қарымта қайтарушы'
            },
            correctAnswer: 'b'
        },
        {
            question: '41. Әл-Хасииб есімі нені білдіреді?',
            answers: {
                a: 'Сақтаушы, қорғаушы',
                b: 'Есептеуші',
                c: 'Үлкен, Аса зор',
                d: 'Асқақ, Бәрінен Биік'
            },
            correctAnswer: 'b'
        },
        {
            question: '42. Әл-Жәлиил есімі нені білдіреді?',
            answers: {
                a: 'Үлкен, Аса зор',
                b: 'Есептеуші',
                c: 'Аса ұлық, аса мәртебелі',
                d: 'Сақтаушы, қорғаушы'
            },
            correctAnswer: 'c'
        },
        {
            question: '43. Әл-Кәриим есімі нені білдіреді?',
            answers: {
                a: 'Кеңпейілді, Бәрін қамтушы',
                b: 'Бақылаушы',
                c: 'Жауап беруші, тілекті қабыл алушы',
                d: 'Аса жомарт'
            },
            correctAnswer: 'd'
        },
        {
            question: '44. Ар-Рақииб есімі нені білдіреді?',
            answers: {
                a: 'Аса жомарт',
                b: 'Жауап беруші, тілекті қабыл алушы',
                c: 'Бақылаушы',
                d: 'Кеңпейілді, Бәрін қамтушы'
            },
            correctAnswer: 'c'
        },
        {
            question: '45. Әл-Мужииб есімі нені білдіреді?',
            answers: {
                a: 'Кеңпейілді, Бәрін қамтушы',
                b: 'Аса жомарт',
                c: 'Жауап беруші, тілекті қабыл алушы',
                d: 'Бақылаушы'
            },
            correctAnswer: 'c'
        },
        {
            question: '46. Әл-Уаасиғ есімі нені білдіреді?',
            answers: {
                a: 'Кеңпейілді, Бәрін қамтушы',
                b: 'Бақылаушы',
                c: 'Аса жомарт',
                d: 'Жауап беруші, тілекті қабыл алушы'
            },
            correctAnswer: 'a'
        },
        {
            question: '47. Әл-Хакиим есімі нені білдіреді?',
            answers: {
                a: 'Дана, хикмет Иесі',
                b: 'Бақылаушы',
                c: 'Жауап беруші, тілекті қабыл алушы',
                d: 'Кеңпейілді, Бәрін қамтушы'
            },
            correctAnswer: 'a'
        },
        {
            question: '48. Әл-Уадууд есімі нені білдіреді?',
            answers: {
                a: 'Қайта Тірілтуші',
                b: 'Даңқты, Ұлы',
                c: 'Сүюші',
                d: 'Куәгер'
            },
            correctAnswer: 'c'
        },
        {
            question: '49. Әл-Мәжиид есімі нені білдіреді?',
            answers: {
                a: 'Сүюші',
                b: 'Даңқты, Ұлы',
                c: 'Қайта Тірілтуші',
                d: 'Куәгер'
            },
            correctAnswer: 'b'
        },
        {
            question: '50. Әл-Баағис есімі нені білдіреді?',
            answers: {
                a: 'Сүюші',
                b: 'Даңқты, Ұлы',
                c: 'Қайта Тірілтуші',
                d: 'Куәгер'
            },
            correctAnswer: 'c'
        },
        {
            question: '51. Әш-Шәһиид есімі нені білдіреді?',
            answers: {
                a: 'Сүюші',
                b: 'Даңқты, Ұлы',
                c: 'Қайта Тірілтуші',
                d: 'Куәгер'
            },
            correctAnswer: 'd'
        },
        {
            question: '52. Әл-Хаққ есімі нені білдіреді?',
            answers: {
                a: 'Ақиқат, Хақ',
                b: 'Даңқты, Ұлы',
                c: 'Қайта Тірілтуші',
                d: 'Куәгер'
            },
            correctAnswer: 'a'
        },
        {
            question: '53. Әл-Уакиил есімі нені білдіреді?',
            answers: {
                a: 'Қамқор, Уәкілдік етуші',
                b: 'Даңқты, Ұлы',
                c: 'Қайта Тірілтуші',
                d: 'Куәгер'
            },
            correctAnswer: 'a'
        },
        {
            question: '54. Әл-Қауий есімі нені білдіреді?',
            answers: {
                a: 'Қамқор, Уәкілдік етуші',
                b: 'Қуатты, Күшті',
                c: 'Қайта Тірілтуші',
                d: 'Куәгер'
            },
            correctAnswer: 'b'
        },
        {
            question: '55. Әл-Мәтиин есімі нені білдіреді?',
            answers: {
                a: 'Қамқор, Уәкілдік етуші',
                b: 'Даңқты, Ұлы',
                c: 'Өте Берік, Мықты',
                d: 'Куәгер'
            },
            correctAnswer: 'c'
        },
        {
            question: '56. Әл-Уалий есімі нені білдіреді?',
            answers: {
                a: 'Қамқор, Уәкілдік етуші',
                b: 'Дос, Жанашыр',
                c: 'Қайта Тірілтуші',
                d: 'Куәгер'
            },
            correctAnswer: 'b'
        },
        {
            question: '57. Әл-Хамиид есімі нені білдіреді?',
            answers: {
                a: 'Мақтаулы',
                b: 'Даңқты, Ұлы',
                c: 'Қайта Тірілтуші',
                d: 'Куәгер'
            },
            correctAnswer: 'a'
        },
        {
            question: '58. Әл-Мухсии есімі нені білдіреді?',
            answers: {
                a: 'Қамқор, Уәкілдік етуші',
                b: 'Даңқты, Ұлы',
                c: 'Бәрін есептеуші',
                d: 'Куәгер'
            },
            correctAnswer: 'c'
        },
        {
            question: '59. Әл-Мубдии есімі нені білдіреді?',
            answers: {
                a: 'Қамқор, Уәкілдік етуші',
                b: 'Даңқты, Ұлы',
                c: 'Қайта Тірілтуші',
                d: 'Бастаушы'
            },
            correctAnswer: 'd'
        },
        {
            question: '60. Әл-Муғиид есімі нені білдіреді?',
            answers: {
                a: 'Қамқор, Уәкілдік етуші',
                b: 'Даңқты, Ұлы',
                c: 'Қайта Тірілтуші',
                d: 'Қайтарушы'
            },
            correctAnswer: 'd'
        },
        {
            question: '61. Әл-Мухии есімі нені білдіреді?',
            answers: {
                a: 'Тірілтуші',
                b: 'Өлтіруші',
                c: 'Мәңгі Тірі',
                d: 'Өздігінен Тұрушы'
            },
            correctAnswer: 'a'
        },
        {
            question: '62. Әл-Мумиит есімі нені білдіреді?',
            answers: {
                a: 'Тірілтуші',
                b: 'Өлтіруші',
                c: 'Мәңгі Тірі',
                d: 'Өздігінен Тұрушы'
            },
            correctAnswer: 'b'
        },
        {
            question: '63. Әл-Хайй есімі нені білдіреді?',
            answers: {
                a: 'Тірілтуші',
                b: 'Өлтіруші',
                c: 'Мәңгі Тірі',
                d: 'Өздігінен Тұрушы'
            },
            correctAnswer: 'c'
        },
        {
            question: '64. Әл-Қаййум есімі нені білдіреді?',
            answers: {
                a: 'Тірілтуші',
                b: 'Өлтіруші',
                c: 'Мәңгі Тірі',
                d: 'Өздігінен Тұрушы'
            },
            correctAnswer: 'd'
        },
        {
            question: '65. Әл-Уаажид есімі нені білдіреді?',
            answers: {
                a: 'Табушы, Бай',
                b: 'Игілікті, Даңқты',
                c: 'Жалғыз',
                d: 'Мұңсыз, Мұқтажсыз'
            },
            correctAnswer: 'a'
        },
        {
            question: '66. Әл-Мәәжид есімі нені білдіреді?',
            answers: {
                a: 'Табушы, Бай',
                b: 'Игілікті, Даңқты',
                c: 'Жалғыз',
                d: 'Мұңсыз, Мұқтажсыз'
            },
            correctAnswer: 'b'
        },
        {
            question: '67. Әл-Уаахид есімі нені білдіреді?',
            answers: {
                a: 'Табушы, Бай',
                b: 'Игілікті, Даңқты',
                c: 'Жалғыз',
                d: 'Мұңсыз, Мұқтажсыз'
            },
            correctAnswer: 'c'
        },
        {
            question: '68. Ас-Самад есімі нені білдіреді?',
            answers: {
                a: 'Табушы, Бай',
                b: 'Игілікті, Даңқты',
                c: 'Мұңсыз, Мұқтажсыз',
                d: 'Мұңсыз, Мұқтажсыз'
            },
            correctAnswer: 'c'
        },
        {
            question: '69. Әл-Қаадир есімі нені білдіреді?',
            answers: {
                a: 'Табушы, Бай',
                b: 'Игілікті, Даңқты',
                c: 'Мұңсыз, Мұқтажсыз',
                d: 'Құдіретті'
            },
            correctAnswer: 'd'
        },
        {
            question: '70. Әл-Муқтадир есімі нені білдіреді?',
            answers: {
                a: 'Табушы, Бай',
                b: 'Игілікті, Даңқты',
                c: 'Мұңсыз, Мұқтажсыз',
                d: 'Бәріне құдіретті'
            },
            correctAnswer: 'd'
        },
        {
            question: '71. Әл-Муқаддим есімі нені білдіреді?',
            answers: {
                a: 'Алға шығарушы',
                b: 'Артқа қоюшы',
                c: 'Ең бірінші',
                d: 'Ең соңғы'
            },
            correctAnswer: 'a'
        },
        {
            question: '72. Әл-Муаххир есімі нені білдіреді?',
            answers: {
                a: 'Алға шығарушы',
                b: 'Артқа қоюшы',
                c: 'Ең бірінші',
                d: 'Ең соңғы'
            },
            correctAnswer: 'b'
        },
        {
            question: '73. Әл-Әууәл есімі нені білдіреді?',
            answers: {
                a: 'Алға шығарушы',
                b: 'Артқа қоюшы',
                c: 'Ең бірінші',
                d: 'Ең соңғы'
            },
            correctAnswer: 'c'
        },
        {
            question: '74. Әл-Аахир есімі нені білдіреді?',
            answers: {
                a: 'Алға шығарушы',
                b: 'Артқа қоюшы',
                c: 'Ең бірінші',
                d: 'Ең соңғы'
            },
            correctAnswer: 'd'
        },
        {
            question: '75. Аз-Зааһир есімі нені білдіреді?',
            answers: {
                a: 'Айқын, Бәрінен жоғары тұрушы',
                b: 'Жасырын, Барлық нәрсені қамтушы',
                c: 'Әмірші',
                d: 'Бәрінен Биік'
            },
            correctAnswer: 'a'
        },
        {
            question: '76. Әл-Баатин есімі нені білдіреді?',
            answers: {
                a: 'Айқын, Бәрінен жоғары тұрушы',
                b: 'Жасырын, Барлық нәрсені қамтушы',
                c: 'Әмірші',
                d: 'Бәрінен Биік'
            },
            correctAnswer: 'b'
        },
        {
            question: '77. Әл-Уаали есімі нені білдіреді?',
            answers: {
                a: 'Айқын, Бәрінен жоғары тұрушы',
                b: 'Жасырын, Барлық нәрсені қамтушы',
                c: 'Әмірші',
                d: 'Бәрінен Биік'
            },
            correctAnswer: 'c'
        },
        {
            question: '78. Әл-Мутәәли есімі нені білдіреді?',
            answers: {
                a: 'Айқын, Бәрінен жоғары тұрушы',
                b: 'Жасырын, Барлық нәрсені қамтушы',
                c: 'Әмірші',
                d: 'Бәрінен Биік'
            },
            correctAnswer: 'd'
        },
        {
            question: '79. Әл-Барр есімі нені білдіреді?',
            answers: {
                a: 'Ізгі, күллі игіліктің, жомарттықтың Иесі',
                b: 'Тәубені тез қабыл алушы',
                c: 'Кек қайтарушы',
                d: 'Ғафу Иесі, Кешірімді'
            },
            correctAnswer: 'a'
        },
        {
            question: '80. Әт-Тәууәәб есімі нені білдіреді?',
            answers: {
                a: 'Ізгі, күллі игіліктің, жомарттықтың Иесі',
                b: 'Тәубені тез қабыл алушы',
                c: 'Кек қайтарушы',
                d: 'Ғафу Иесі, Кешірімді'
            },
            correctAnswer: 'b'
        },
        {
            question: '81. Әл-Мунтәқим есімі нені білдіреді?',
            answers: {
                a: 'Ізгі, күллі игіліктің, жомарттықтың Иесі',
                b: 'Тәубені тез қабыл алушы',
                c: 'Кек қайтарушы',
                d: 'Ғафу Иесі, Кешірімді'
            },
            correctAnswer: 'c'
        },
        {
            question: '82. Әл-Афуу есімі нені білдіреді?',
            answers: {
                a: 'Ізгі, күллі игіліктің, жомарттықтың Иесі',
                b: 'Тәубені тез қабыл алушы',
                c: 'Кек қайтарушы',
                d: 'Ғафу Иесі, Кешірімді'
            },
            correctAnswer: 'd'
        },
        {
            question: '83. Ар-Раууф есімі нені білдіреді?',
            answers: {
                a: 'Мейірбан',
                b: 'Патшалықтардың, Биліктің Патшасы, Иесі',
                c: 'Ұлылық пен Жомарттықтың Иесі',
                d: 'Құдіретті'
            },
            correctAnswer: 'a'
        },
        {
            question: '84. Мәәликул-мулк есімі нені білдіреді?',
            answers: {
                a: 'Мейірбан',
                b: 'Патшалықтардың, Биліктің Патшасы, Иесі',
                c: 'Ұлылық пен Жомарттықтың Иесі',
                d: 'Ізгі, күллі игіліктің, жомарттықтың Иесі'
            },
            correctAnswer: 'b'
        },
        {
            question: '85. Зул-жәләли уал-икрам есімі нені білдіреді?',
            answers: {
                a: 'Мейірбан',
                b: 'Патшалықтардың, Биліктің Патшасы, Иесі',
                c: 'Ұлылық пен Жомарттықтың Иесі',
                d: 'Кешірімді'
            },
            correctAnswer: 'c'
        },
        {
            question: '86. Әл-Муқсит есімі нені білдіреді?',
            answers: {
                a: 'Өте әділетті',
                b: 'Жинаушы',
                c: 'Бай, ештеңеге мұқтаж емес',
                d: 'Байытушы'
            },
            correctAnswer: 'a'
        },
        {
            question: '87. Әл-Жаамиғ есімі нені білдіреді?',
            answers: {
                a: 'Өте әділетті',
                b: 'Жинаушы',
                c: 'Бай, ештеңеге мұқтаж емес',
                d: 'Байытушы'
            },
            correctAnswer: 'b'
        },
        {
            question: '88. Әл-Ғаний есімі нені білдіреді?',
            answers: {
                a: 'Өте әділетті',
                b: 'Жинаушы',
                c: 'Бай, ештеңеге мұқтаж емес',
                d: 'Байытушы'
            },
            correctAnswer: 'c'
        },
        {
            question: '89. Әл-Муғний есімі нені білдіреді?',
            answers: {
                a: 'Өте әділетті',
                b: 'Жинаушы',
                c: 'Бай, ештеңеге мұқтаж емес',
                d: 'Байытушы'
            },
            correctAnswer: 'd'
        },
        {
            question: '90. Әл-Мааниғ есімі нені білдіреді?',
            answers: {
                a: 'Зияндық беруші',
                b: 'Пайда беруші',
                c: 'Нұр Иесі, нұрландырушы',
                d: 'Тыйым салушы, Тоқтатушы'
            },
            correctAnswer: 'd'
        },
        {
            question: '91. Ад-Даарр есімі нені білдіреді?',
            answers: {
                a: 'Зияндық беруші',
                b: 'Пайда беруші',
                c: 'Нұр Иесі, нұрландырушы',
                d: 'Тыйым салушы, Тоқтатушы'
            },
            correctAnswer: 'a'
        },
        {
            question: '92. Ән-Наафиғ есімі нені білдіреді?',
            answers: {
                a: 'Зияндық беруші',
                b: 'Пайда беруші',
                c: 'Нұр Иесі, нұрландырушы',
                d: 'Тыйым салушы, Тоқтатушы'
            },
            correctAnswer: 'b'
        },
        {
            question: '93. Ән-Нуур есімі нені білдіреді?',
            answers: {
                a: 'Зияндық беруші',
                b: 'Пайда беруші',
                c: 'Нұр Иесі, нұрландырушы',
                d: 'Тыйым салушы, Тоқтатушы'
            },
            correctAnswer: 'c'
        },
        {
            question: '94. Әл-Һәәди есімі нені білдіреді?',
            answers: {
                a: 'Туралыққа бастаушы',
                b: 'Көркем Жаратушы',
                c: 'Мәңгі қалушы',
                d: 'Мирасқор'
            },
            correctAnswer: 'a'
        },
        {
            question: '95. Әл-Бәдииғ есімі нені білдіреді?',
            answers: {
                a: 'Туралыққа бастаушы',
                b: 'Көркем Жаратушы',
                c: 'Мәңгі қалушы',
                d: 'Мирасқор'
            },
            correctAnswer: 'b'
        },
        {
            question: '96. Әл-Баақи есімі нені білдіреді?',
            answers: {
                a: 'Туралыққа бастаушы',
                b: 'Көркем Жаратушы',
                c: 'Мәңгі қалушы',
                d: 'Мирасқор'
            },
            correctAnswer: 'c'
        },
        {
            question: '97. Әл-Уаарис есімі нені білдіреді?',
            answers: {
                a: 'Туралыққа бастаушы',
                b: 'Көркем Жаратушы',
                c: 'Мәңгі қалушы',
                d: 'Мирасқор'
            },
            correctAnswer: 'd'
        },
        {
            question: '98. Ар-Рашиид есімі нені білдіреді?',
            answers: {
                a: 'Туралыққа бастаушы',
                b: 'Көркем Жаратушы',
                c: 'Мәңгі қалушы',
                d: 'Мирасқор'
            },
            correctAnswer: 'a'
        },
        {
            question: '99. Ас-Сабуур есімі нені білдіреді?',
            answers: {
                a: 'Туралыққа бастаушы',
                b: 'Көркем Жаратушы',
                c: 'Мәңгі қалушы',
                d: 'Аса сабырлы'
            },
            correctAnswer: 'd'
        }
    ];

    let currentQuestion = 0;
    let score = 0;

    function showQuestion(index) {
        const questionData = questions[index];
        const answers = questionData.answers;

        let answersHTML = '';
        for (const option in answers) {
            answersHTML += `
                <label>
                    <input type="radio" name="q${index}" value="${option}">
                     ${option.toUpperCase()}: ${answers[option]}
                </label><br>
            `;
        }

        quizForm.innerHTML = `
            <div class="question">
                <p>${questionData.question}</p>
                ${answersHTML}
            </div>
        `;
    }

    function checkAnswer(index) {
        const questionData = questions[index];
        const selectedOption = document.querySelector(`input[name="q${index}"]:checked`);
        
        if (selectedOption) {
            const userAnswer = selectedOption.value;
            if (userAnswer === questionData.correctAnswer) {
                score++;
            }
        }
    }

    function showResult() {
        quizForm.classList.add('hidden');
        quizControls.classList.add('hidden');
        resultSection.classList.remove('hidden');

        scoreDisplay.textContent = `Сіз ${questions.length} сұрақтың ішінен ${score} сұраққа дұрыс жауап бердіңіз.`;
    }

    startTestBtn.addEventListener('click', function() {
        startTestBtn.style.display = 'none';
        quizForm.classList.remove('hidden');
        quizControls.classList.remove('hidden');
        welcomeText.style.display = 'none';

        showQuestion(currentQuestion);
    });

    prevBtn.addEventListener('click', function() {
        if (currentQuestion > 0) {
            checkAnswer(currentQuestion);
            currentQuestion--;
            showQuestion(currentQuestion);
        }
    });

    nextBtn.addEventListener('click', function() {
        checkAnswer(currentQuestion); // Проверяем ответ на текущий вопрос
    
        if (currentQuestion < questions.length - 1) {
            // Если не последний вопрос, переходим к следующему вопросу
            currentQuestion++;
            showQuestion(currentQuestion);
        } else {
            // Если текущий вопрос последний, вызываем функцию для завершения теста
            finishTest();
        }
    });
    
    function finishTest() {
        checkAnswer(currentQuestion);
        showResult();
    }
    
    finishBtn.addEventListener('click', function() {
        checkAnswer(currentQuestion);
        showResult();
    });
});
